from random import *

wiki = {
    'Плащ шамана-гоблина': [[["Урон", 4], ['Защита', 3]], 'Броня'],
    'Диадема лесной дриады': [[['Урон', 6], ['Ловкость', 5]], 'Броня'],
    'Маска стеснительного орка': [[['Защита', 7], ['Очки здоровья', 4]], 'Броня'],
    'Накидка из шкуры оленя-перевёртыша': [[['Урон', 5], ['Очки здоровья', 4], ['Защита', -3]], 'Броня'],
    'Пояс разбойника Первого': [[['Урон', 8], ['Очки здоровья', 2], ['Защита', 6]], 'Броня'],
    'Перчатки разбойника Второго': [[['Урон', 10], ['Ловкость', 3], ['Защита', 6]], 'Броня'],

    'Книга заклинаний': [[['Урон', 6]], 'Орудие'],
    'Орб-слизь': [[['Урон', 10], ['Защита', 6]], 'Орудие'],
    'Ножи разбойника': [[['Урон', 8], ['Ловкость', 4]], 'Орудие'],
    'Плеть разбойника': [[['Урон', 6], ['Ловкость', 7]], 'Орудие'],
    'Дубинка стеснительного орка': [[['Урон', 12], ['Ловкость', -4]], 'Орудие'],
    'Рыцарский меч': [[['Урон', 6]], 'Орудие'],
    'Посох шамана-гоблина': [[['Урон', 7]], 'Орудие'],
    'Клинок. Просто клинок.': [[['Урон', 6], ['Ловкость', 4]], 'Орудие'],

    'Клык звёздной лисицы': [[['Урон', 10], ['Защита', 10], ['Ловкость', 10]], 'Аксессуар'],
    'Кулон шипастой дриады': [[['Урон', 8], ['Защита', 6]], 'Аксессуар'],
    'Рог оленя-перевёртыша': [[['Урон', 8], ['Ловкость', 4]], 'Аксессуар'],
    'Серьга гоблина': [[['Урон', 5], ['Защита', 2]], 'Аксессуар'],
    'Талисман Сияющей слизи': [[['Урон', 6], ['Ловкость', 6], ['Защита', 8]], 'Аксессуар'],
}
wiki_monsters = {
    "Бабочка": [(1,2), (1,1), (13,18), (0,0), (0,5), 17],
    "Гоблин": [(3,6), (3,6), (2,5), (2,5), (2,4), 15,
            ['Серьга гоблина', 'Ягодный сок', "Кость"]],
    "Гоблин-шаман": [(3,6), (4,10), (2,4), (2,5), (3,5), 23,
            ['Плащ шамана-гоблина', 'Книга заклинаний', 'Ягодный сок']],
    "Орк": [(10,19), (6,8), (2,4), (10,12), (13,16), 35,
            ['Красное яблоко', 'Пятнистый гриб', ]],
    "Стеснительный орк": [(25,36), (7,10), (2,4), (12,15), (32,50), 54,
            ['Маска стеснительного орка', 'Красное яблоко', 'Дубинка стеснительного орка']],
    "Голубая слизь": [(5,8), (3,5), (13,18), (2,5), (8,15), 34,
            ['Голубая слизь', 'Пятнистый гриб', 'Родниковая вода', 'Талисман Сияющей слизи', 'Орб-слизь', 'Ножи разбойника']],
    "Розовая слизь": [(13,16), (3,5), (2,5), (2,5), (8,15), 30,
            ['Розовая слизь', 'Родниковая вода', 'Книга заклинаний', 'Талисман Сияющей слизи', 'Орб-слизь']],
    "Красная слизь": [(3,6), (8,10), (2,5), (2,5), (8,15), 25,
            ['Красная слизь', 'Красное яблоко', 'Родниковая вода', 'Талисман Сияющей слизи', 'Орб-слизь', 'Рыцарский меч']],
    "Олень-перевёртыш": [(15,20), (10,16), (7,10), (3,7), (13,20), 37,
            ['Накидка из шкуры оленя-перевёртыша', 'Рог оленя-перевёртыша', "Кость"]],
    "Скелет": [(3,6), (3,6), (2,5), (2,5), (2,4), 18,
            ['Кость']],
    "Разбойник":[(7,10), (6,8), (6,9), (3,7), (5,10), 27,
            ['Ножи разбойника', 'Плеть разбойника', 'Рыцарский меч', "Ягодный сок", "Паёк разбойника", "Красное яблоко"]],
    "Разбойник Первый":[(10,17), (10,16), (7,10), (4,7), (13,20), 37,
            ['Пояс разбойника Первого', 'Перчатки разбойника Второго', 'Ножи разбойника', 'Плеть разбойника', "Паёк разбойника"]],
    "Дриада":[(10,13), (8,10), (10,14), (5,8), (20,30), 40,
            ['Диадема лесной дриады', "Родниковая вода", "Красное яблоко", "Кровь лесной дриады", "Ягодный сок"]],
    "Шипастая Дриада":[(20,27), (13,16), (10,14), (5,8), (20,30), 50,
            ['Диадема лесной дриады', "Родниковая вода", "Красное яблоко", "Кровь лесной дриады", "Ягодный сок"]],
    "???":[],
}
wiki_consume = {
    "Ягодный сок": ["- СооООоок (˶˃⤙˂˶)",
            [['Очки здоровья', 5], ['Ловкость', 3]], "Еда"],
    "Кровь лесной дриады": ["- ПаХнЕт ЦвЕтамИ",
            [['Очки здоровья', 6], ['Ловкость', 2], ['Защита', 1]], "Еда"],
    "Розовая слизь": ["- мНе НрАвИтся РоЗоВЫЙ :>> а теБе?",
            [['Очки здоровья', 10]], "Еда"],
    "Голубая слизь": ["- ПоЧеМУ-То ВсеГдА хоЛоДнаЯ",
            [['Очки здоровья', 2], ['Ловкость', 5]], "Еда"],
    "Красная слизь": ["- на вкУс кАК рУбИны ⊹˙✦°。",
            [['Очки здоровья', 1], ['Урон', 6]], "Еда"],
    "Красное яблоко": ["- КрАсииИВое",
            [['Очки здоровья', 4], ['Ловкость', 3]], "Еда"],
    "Паёк разбойника": ["- ЧеЛоВеЧЕскАя еДА",
            [['Очки здоровья', 5], ['Ловкость', 3]], "Еда"],
    "Пятнистый гриб": ["- вЫглЯдиТ ОчЕнЬ СТраНно (←人←)",
            [['Очки здоровья', 0], ['Защита', 0]], "Еда"],
    "Родниковая вода": ["- пРоЗрааЧнАя (ノ= ⩊ = )ノ",
            [['Очки здоровья', 4], ['Ловкость', 3]], "Еда"],
    "Кость": ["- ммМ, кАЛьцИй",
            [['Очки здоровья', 3], ['Защита', 3]], "Еда"],

    'Плащ шамана-гоблина': ['- ПлАщ, пРоПИТанНЫй ИСКусСТвоМ чуДОдейСТвА ГоБЛиНОв! ЕСЛи оНО У нИХ еСТь? ХыХЫ',
            [["Урон", 1], ['Очки здоровья', 3]], 'Броня'],
    'Диадема лесной дриады': ["- ЦвеТоОчНаЯ кОроНа жЕсТоКОй хРАниТЕльНиЦы лЕсА",
            [['Очки здоровья', 3], ['Ловкость', 2]], 'Броня'],
    'Маска стеснительного орка': ["- ЧёРнАЯ мАСкА пРеДВоДиТЕлЯ оРКоВ. И чЕго Он СТеЕСняЛсЯ?",
            [['Защита', 3], ['Очки здоровья', 4]], 'Броня'],
    'Накидка из шкуры оленя-перевёртыша': ["- ОТ еЁ вида МНе нЕМНогО жУТкО...",
            [['Урон', 4], ['Очки здоровья', 3], ['Защита', -1]], 'Броня'],
    'Пояс разбойника Первого': ["- сТрАннОЕ емУ иМя дАлИ",
            [['Урон', 4], ['Очки здоровья', 1], ['Защита', 2]], 'Броня'],
    'Перчатки разбойника Второго': ["- Их еЩё И дВОе??",
            [['Урон', 3], ['Ловкость', 1], ['Защита', 3]], 'Броня'],

    'Книга заклинаний': ['- КАкаЯ кНижкАа :З',
                         [['Урон', 2], ['Очки здоровья', 3]], 'Орудие'],
    'Орб-слизь': ['- кАк Мы („• ֊ •„)',
                         [['Урон', 4], ['Защита', 2], ['Очки здоровья', 6]], 'Орудие'],
    'Ножи разбойника': ['- КАкаЯ кНижкАа... чТо? РазВе неТ?',
                         [['Урон', 2], ['Ловкость', 4], ['Очки здоровья', 4]], 'Орудие'],
    'Плеть разбойника': ['- оНа дЕлаЕт сВиСт-хРясЬ ( = □ = )',
                         [['Урон', 5], ['Очки здоровья', 4]], 'Орудие'],
    'Дубинка стеснительного орка': ['- тАкаЯ БолЬшАя, хы',
                         [['Урон', 4], ['Ловкость', -3], ['Очки здоровья', 7]], 'Орудие'],
    'Рыцарский меч': ['- БлЕсТЯщИй И ОстРыЙ, КаК ПОлАгаЕтсЯ РыЦАрю ｡✦°⋆',
                         [['Урон', 2], ['Очки здоровья', 3]], 'Орудие'],
    'Посох шамана-гоблина': ['- дЕрЕВЯшКа и кРисТАлиК, а СозДаёТ МАгиЮ ( ´ ▿ ` )',
                        [['Урон', 3], ['Очки здоровья', 4]], 'Орудие'],
    'Клинок. Просто клинок.': ['- нУ кЛиНОк и КлИНоК',
                        [['Урон', 6], ['Очки здоровья', 6]], 'Орудие'],

    'Клык звёздной лисицы': ['- ваУ... СиЯет, каК звЁздне нЕбо',
                               [['Урон', 3], ['Очки здоровья', 6]], 'Аксессуар'],
    'Кулон шипастой дриады': ['- тАкаЯ оНа нЕдОобрая ( ＞.＜) дАжЕ КулОН с кОлюЧкаМи',
                             [['Урон', 6], ['Очки здоровья', 1]], 'Аксессуар'],
    'Рог оленя-перевёртыша': ['- ОсТРыййй',
                             [['Урон', 6], ['Очки здоровья', 1]], 'Аксессуар'],
    'Серьга гоблина': ['- кАмУшеК бЛестИт, хЕхе',
                             [['Урон', 6], ['Очки здоровья', 1]], 'Аксессуар'],
    'Талисман Сияющей слизи': ['- он сВетИтся, сМотрИ... иНтерЕСно, КоГдА мЫ тАк смоЖеМ?',
                             [['Урон', 6], ['Очки здоровья', 1]], 'Аксессуар'],
}
wiki_location = {
    'Лес': [["Бабочка", "Гоблин", "Гоблин-шаман", "Орк", "Голубая слизь", "Розовая слизь", "Красная слизь", "Олень-перевёртыш", "Дриада"],
            ['Рог оленя-перевёртыша', 'Серьга гоблина', 'Накидка из шкуры оленя-перевёртыша',
             'Диадема лесной дриады', 'Ножи разбойника', 'Клинок. Просто клинок.', "Красное яблоко", "Пятнистый гриб"],
            ['෴ᛏ↟෴↟ᛉ↟', 'ᛏ↟෴↟ᛉ෴⸙'],
            ['- сМотРи, ТаМ ЧТо-То ВнуТрИ дУпЛа?', '- В ЭтоМ кУСте КажЕтсЯ чТО-то естЬ...']],

    'Чаща': [["Бабочка", "Дриада", "Шипастая Дриада", "Голубая слизь", "Розовая слизь", "Красная слизь", "Скелет"],
             ['Рог оленя-перевёртыша', 'Диадема лесной дриады', 'Талисман Сияющей слизи', "Родниковая вода"],
             ['↟ᛏ෴↟⸙ᛉ ⭑⭑ ᛘ','෴↟ᛏ⸙'],
             ['- СплОшНые ДжуНгли... в вЕтвЯх что-То заПуталОсь?', '- пОхожЕ на тАйНик... КоПаЙ СкоРЕе!']],

    'Поле': [["Бабочка", "Гоблин", "Гоблин-шаман", "Разбойник", "Голубая слизь", "Розовая слизь", "Красная слизь"],
             ["Родниковая вода", "Красное яблоко"], ['៶៸៶៸៶៸ʬʬᖗᖘʬʬ', 'ᖗʬᖘʬ ꔠꔠꔠ'],
             ['- ТыкВа, тЫкВа! а МожЕт И нЕТ??', '- сМотРи-смОтРи! выГлЯдит, кАк чтО-То, ЧеМу лучШе пОбЫть у НАс']],

    'Дорога': [["Бабочка", "Разбойник", "Разбойник Первый", "Голубая слизь", "Розовая слизь", "Красная слизь", "Гоблин"],
               ["Паёк разбойника", "Ягодный сок", "Красное яблоко"], ['☱☲☳☴☵☶', '☷☱☲☳☴'],
                ['- РаЗбИтАя пОВозкА... ПоШлИ поСМоТРим!!', '- кАк БУдто что-То ВалЯетСя. ЧтО-То спеЦиАльНо длЯ НаС!']],

    'Пещера': [["Голубая слизь", "Розовая слизь", "Красная слизь", "Орк", "Стеснительный орк", "Гоблин", "Скелет"],
               ['Клинок. Просто клинок.', 'Рыцарский меч', 'Талисман Сияющей слизи', "Пятнистый гриб", 'Накидка из шкуры оленя-перевёртыша',
                'Книга заклинаний', 'Орб-слизь', 'Ножи разбойника', 'Плеть разбойника', 'Серьга гоблина', "Розовая слизь", "Голубая слизь",
                "Красная слизь"], ['꒷꒦☸꒷⭑︶ ๋ ࣭', ' ⭑꒷꒦☸'],
              ['- АУУУ - Аууу - ауу - ау... КрУтоЕ ЭХо!! Ой, А что Это ТАм?', '- поД эТим кАмНем, кАжеТсЯ, ЧтО-то засТРяло?']],

    'Поляна цветов': [[], [], ['❁✿❀','❁✿❀']],
}
def razdva(a,b):
    return a if randint(0,1)==0 else b
class Player:
    def __init__(self):
        self.name = ''
        self.stats = []
        self.level, self.exp, self.free_points = -1, 0, 0
        self.equipment = {
            'Броня':'-',
            'Аксессуар': '-',
            'Орудие': '-',
        }
        self.inventory = ['Красное яблоко']
        self.location = 'Поле'
    def get_stats(self):
        is_fit = 0
        while is_fit != 25:
            stats = {
                'Очки здоровья': randint(3, 10),
                'Урон': randint(2, 10),
                'Ловкость': randint(1, 10),
                'Защита': randint(3, 10),
            }
            is_fit = sum(stats.values())
        self.stats = stats
        print("     ЭТО ТЫ\n"
              "       |\n"
              "       v\n")
        self.greet()
        self.re_stats()
    def get_exp_bar(self):
        self.exp_bar = (self.exp // (self.exp_next//10))*'▓' + (10 - len((self.exp // (self.exp_next//10))*'▓'))*'░'
    def get_level(self):
        self.level += 1
        self.free_points += self.level * 5
        self.exp_next = 10
        match self.level:
            case 0: self.exp_next = 10
            case 1: self.exp_next = 50
            case 2: self.exp_next = 100
            case 3: self.exp_next = 500
            case 4: self.exp_next = 1000
        self.get_exp_bar()
    def show_all(self):
        print('\n'
            f"⠀⠀⠀⠀⠀⠀⠙⣷⠀⠀⠀⠀⠀⠀      Имя: {self.name}\n"
            f"⠀⠀⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀     Уровень: {self.level}\n"
            f"⠀ ⡟⠀⠀⠀⠀⠀⠀ ⠀⢻⠀⠀      \n"
            f"⠸⣤⠀⠀⣿⠀⠀⠀⣿⠀⠀⣤⠇⠀     {self.exp_bar} {self.exp}/{self.exp_next}\n"
            f"⠀ ⠈⠷⢦⠀⠀⠀⡶⠾⠁⠀⠀     \n"
            f"⠀⠀⠀⣰⠛⠋⠉⠙⠛⣆⠀⠀⠀⠀    ・Очки здоровья: {self.stats['Очки здоровья']}\n"
            f"⠀⢠⡟⢰ ⠀⠀⠀ ⡆⢻⡄⠀⠀    ・Урон: {self.stats['Урон']}\n"
            f"⠀⠀⠀⢸⠀⢰⠉⡆⠀⡇⠀⠀⠀⠀    ・Ловкость: {self.stats['Ловкость']}\n"
            f"⠀⠀⠀⠘⠶⠟⠀⠻⠶⠃⠀⠀⠀⠀    ・Защита: {self.stats['Защита']}\n"
        )
        if self.free_points > 0:
            print(f'   (Доступны очки развития: {player.free_points})\n')
        print(f'▐ Броня: {self.equipment["Броня"]}  '
              f'▐ Орудие: {self.equipment["Орудие"]}  '
              f'▐ Аксессуар: {self.equipment["Аксессуар"]}\n')
        print('     ✦ Инвентарь ✦')
        for i, item in enumerate(self.inventory):
            print(i + 1, '-', item)
        print('')
    def greet(self):
        print(
            f"⠀⠀⠀⠀⠀⠀⠙⣷⠀⠀⠀⠀⠀⠀  \n"
            f"⠀⠀⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀ \n"
            f"⠀ ⡟⠀⠀⠀ ⠀⠀⠀⠀⢻⠀⠀  ・Очки здоровья: {self.stats['Очки здоровья']}\n"
            f"⠸⣤⠀⠀⣿⠀⠀⠀⣿⠀⠀⣤⠇⠀ ・Урон: {self.stats['Урон']}\n"
            f"⠀ ⠈⠷⢦⠀⠀⠀⡶⠾⠁⠀⠀  ・Ловкость: {self.stats['Ловкость']}\n"
            f"⠀⠀⠀⣰⠛⠋⠉⠙⠛⣆⠀⠀⠀⠀ ・Защита: {self.stats['Защита']}\n"
            f"⠀⢠⡟⢰ ⠀⠀⠀ ⡆⢻⡄⠀⠀ \n"
            f"⠀⠀⠀⢸⠀⢰⠉⡆⠀⡇⠀⠀⠀⠀ \n"
            f"⠀⠀⠀⠘⠶⠟⠀⠻⠶⠃⠀⠀⠀⠀ \n"
        )
    def re_stats(self):
        is_ok = ''
        while is_ok not in ['0','1','2']:
            is_ok = input("- кАК ТеБе ХАраКТЕрИсТИКи? ХоЧЕшь ПОмЕняТЬ? (0 - Сойдёт, 1 - Давай поменяем, 2 - Поменяй ты)\n")
        if is_ok == '1':
            print("- ЛАдНО! НАзНАЧаЙ в ТАкОМ ПОряДКе: ЗдОроВЬЕ, УрОН, ЛОвкоСТь, ЗАЩиТа. СМоТри ТоЛЬКО, В СУмМЕ ДоЛЖно БыТь 25!")
            stats_keys = [i for i in self.stats.keys()]
            soul_points = 25
            while soul_points != 0:
                try:
                    planned_stats = input('- ВВодИ 4 ЗнаЧЕнИя. ЧеРЕз ПроБЕЛ!\n')
                    planned_stats = [int(i) for i in planned_stats.split()]
                    for i, key in enumerate(stats_keys):
                        self.stats[key] = planned_stats[i]
                        soul_points -= planned_stats[i]
                    if soul_points != 0:
                        print(f"- ЕЩё ОСТАлОСь {soul_points}! ДАвАЙ ПО НОвОЙ.")
                        if soul_points < 0:
                            print(f'- Да, В МиНУС ПОшлО!')
                        soul_points = 25
                    else:
                        self.greet()
                        self.re_stats()
                except:
                    print("- ЧТО-тО тЫ НАмуДрИл... ПоВТоРи?")
                    self.re_stats()

        elif is_ok == '2':
            print("\n- ЛАДНа! СмОТри!\n")
            self.get_stats()
        elif is_ok == '0':
            print('- МНЕ тОЖЕ ЭтИ НрАВятСЯ :D')
            self.get_level()
    def points(self):
        for i in self.stats.keys():
            print('      дОстУпНые оЧки:', self.free_points, '\n')
            player_choice = ' '
            while any(i not in '0123456789' for i in player_choice):
                player_choice = input(f'- сКОльКо пОтРаТим нА {i}?\n')
            if player_choice == '':
                player_choice = '0'
            elif int(player_choice) > self.free_points:
                player_choice = self.free_points
            self.free_points -= int(player_choice)
        print("- РаСпрЕдлеНие ЗаВЕршЕно :P\n")
    def rest(self):
        print('\n'
              '      ⠀⠀⠀⠀⠀        ⠀⠙⣷⠀⠀⠀⠀⠀⠀✚\n'
              '      ⠀        ⠀⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀   ⣤⣻⢿⣤⠀\n'
              '        ✚     ⠀⢰⡟⠀⠀⠀⠀⠀⠀⠀⢻⣆⠀⠀   ⠛⣹⣾⠛⠃⠀ \n'
              '              ⠸⣤⠀⠀⣿⠀⠀⠀⣿⠀⠀⣤⠇⠀     \n'
              '⣤ ⣛⣛⠀⣤       ⠀⠀⠀⡰⠛⠙⣤⠋⠛⣆⠀⠀⠀⠀          ⢰⠋⠂\n'
              '⠛ ⣭⣭⠀⠛⠀       ⢠⡟⢰ ⠀⣿⠀ ⡆⢻⡄     ✚    ⠈⢳⢸⡞⠁\n'
              '               ⠈⠉⠘⠶ ⠛ ⠶⠃⠉⠁ ⠀          ⠇\n'
              '     ⠐⠙⡆                       ⠀⠀              ⠀⢠⡶⣛⢶⡄⠀⠀\n'
              '     ⠈⢳⣇        О Т Д Ы Х . . .         ⠀       ⠘⠷⣭⠾⠃⠀⠀\n\n')
        self.stats['Очки здоровья'] += 10
    def get_hurt(self, enemy):
        damage = max(1,(enemy.damage-self.stats['Защита']))
        self.stats['Очки здоровья'] = max(self.stats['Очки здоровья'] - damage, 0)
        emotes = ['☆(＃××)','(౦ ‸ ౦)','(･ × ･)','(>_<)','(`︿´)','(・人・)']
        print(f'- -{damage} ОЗ бАй {enemy.kind} {choice(emotes)} ОсТАлосЬ {self.stats['Очки здоровья']} ОЗ')
    def die(self):
        print(razdva('- нет... мы... умираем?\n', '- ой, это... конец?..\n'))
        print('\n'
              '          ⠀⠀⠀⠀⠀           ⣠⣤⠀⠀⠀⠀⠀                                    \n'
              '          ⠐⠙⡆         ⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀   ⣞⠛⠛⣦       ⠐⠙⡆               \n'
              '          ⠈⢳⣇        ⢠⡟⠀⠀ ⠀⠀⠀⠀⠀⢻⡆⠀⠀   ⠀          ⠈⢳⢸               \n'
              '                   ⣠⠶⠟ ⠀⢴⣷⠀⢀⣴⣄⠀ ⢰⠋⠂             ⠈⢳⣿⡞⠁             \n'
              '     ⣴⠛⠛⠛⠷⣄      ⠈⠉⠛⠛⠶⣤⠶⠛⠉⠁ ⠈⢳⢸⡞⠁                                \n'
              '                                                                     \n'
              '    ⢰⡎⠂        И Г Р А   О К О Н Ч Е Н А     ⠈⣄          ⣴⠛⠛⣳      \n'
              '  ⠈⢳⣿⡞⠁                                      ⣤⠿                    \n'
              '                           ⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠛⠶⠶⣤⣤⠶                      \n'
              '                          \n')
    def show_inventory(self, inventory):
        print('     ✦ Инвентарь ✦')
        for i, item in enumerate(inventory):
            print(i+1,'-', item)
    def unequip(self, item):
        self.equipment[wiki[item][-1]] = '-'
        self.inventory.append(item)
        item_stats = wiki[item][0]
        print(f"- Мы СнЯЛиИ: {item} (0 ,<)", *[i[0] + ' -' + str(i[1]) for i in item_stats])
        for i in item_stats:
            self.stats[i[0]] -= i[1]
        print('')
    def equip(self, item):
        if self.equipment[wiki[item][-1]] == '-':
            self.equipment[wiki[item][-1]] = item
            self.inventory.remove(item)
            item_stats = wiki[item][0]
            print(f"- ОБнОВка!! {item} |", *[i[0] + ' +' + str(i[1]) for i in item_stats])
        elif self.equipment[wiki[item][-1]] != '-':
            yesno = ''
            while yesno not in ['1','2']:
                print(f"- ЭтА каТЕгОРИя уЖЕ зАНЯтА: {self.equipment[wiki[item][-1]]}. ПОмЕнЯеМ? (1 - Да, 2 - Нет)")
                yesno = input()
            if yesno == '1':
                self.unequip(self.equipment[wiki[item][-1]])
                return self.equip(item)
            else:
                return print("")
        for i in wiki[item][0]:
            self.stats[i[0]] += i[1]
        print('')
    def consume(self, item):
        item_stats = wiki_consume[item][1]
        print(f"- НакУшАлИ, хЕх ૮₍ •⤙•˶₊ ", *[i[0] + ' +' + str(i[1]) for i in item_stats], '\n')
        for i in item_stats:
            self.stats[i[0]] += i[1]
        self.inventory.remove(item)
player = Player()
print("\n- ПРиВЕи! ДоБРо ПОжаЛоВать в МИр! КтО я? НУ... КтО-тО? БЕз ПОНЯтиЯ, КтО Я. ЗаТО ЗнАЮ, ЧТО ты - ЧеЛОвЕкоПоДОбнАя сЛИзЬ!\n")
player.get_stats()
player.name = input("- КСтаТИ, А МЫ веДЬ С ИМенЕМ еЩЕ не ОПреДЕлиЛиь... КАк НАс ЗоВУт??\n")
print(f"- КрУТо! {player.name}!")
class Creature:
    def __init__(self, kind, health=(3,10), damage = (1,10), speed=(1,10), defense=(1,5), experience=(3,6), stats_base=25, loot = ['']):
        self.level = max(randint(player.level-1,player.level+1), 0) if player.level != 0 else 0
        self.exp = randint(*experience)
        self.kind = kind
        self.loot = choice(loot)
        is_fit = 0
        while is_fit != (stats_base + self.level * 28):
            self.health = randint(*health) + self.level * 7
            self.damage = randint(*damage) + self.level * 7
            self.speed = randint(*speed) + self.level * 7
            self.defense = randint(*defense) + self.level * 7
            is_fit = self.health+self.damage+self.speed+self.defense
    def show_stats(self):
        print(
            f'{self.kind} УР {self.level}\n'
            f'{"-"*20}\n'
            f'Очки здоровья: {self.health}\n'
            f'Урон: {self.damage}\n'
            f'Ловкость: {self.speed}\n'
            f'Защита: {self.defense}\n'
        )
    def attack(self):
        player.get_hurt(self)
    def get_hurt(self, enemy):
        self.hurt = max(2,(enemy.stats['Урон']-self.defense)) if self.defense < enemy.stats['Урон'] else randint(1,2)
        self.health = max(self.health - self.hurt, 0)

def menu(player):
    def pause():
        a = input('(Enter для продолжения)\n')
    def location():
        print(f'- мЫ сеЙчаС тУт: {wiki_location[player.location][2][0]} {player.location} {wiki_location[player.location][2][1]}\n')
        player_choice = ''
        while player_choice not in ['1','2','3']:
            player_choice = input("- ЧтО дЕлАТь БуДЕм? (1 - Исследовать, 2 - Идти, 3 - Открыть инвентарь)\n")
        if player_choice == '1':
            if player.location == 'Поляна цветов':
                print('- пРосто тихАя цВетОчная полЯна... чТо тут исследОвать?\n')
                return location()
        elif player_choice == '2':
            print("- и КуДА ПоЙдЁм?\n")
            if player.location != 'Поляна цветов':
                print('0 - Остаться и исследовать')
            for i, loc in enumerate(locations):
                print(i+1, '-', wiki_location[loc][2][0], loc, wiki_location[loc][2][1])
            player_loc_choice = ''
            while player_loc_choice not in ['1','2','0']:
                player_loc_choice = input()
            if player_loc_choice != '0':
                player.location = locations[int(player_loc_choice)-1]
            elif player_loc_choice == '0' and player.location == 'Поляна цветов':
                print('- такого ВаРиаНта в СписКе не бЫлО\n')
        elif player_choice == '3':
            inventory(0)
    def gen_loc():
        ava_loc = list(wiki_location.keys())
        ava_loc.remove(player.location)
        locations = sample(ava_loc, k=2)
        return locations
    def gen_mon():
        cur_mon = [choice(wiki_location[player.location][0]) for i in range(randint(1, 3))]
        cur_mon = [Creature(i, *wiki_monsters[i]) for i in cur_mon]
        return cur_mon
    def mon_meet():
        for i in cur_mon:
            i.show_stats()
    def choice_menu():
        player_choice = ''
        while player_choice not in ['1','2','3','4','5']:
            player_choice = input("- ЧтО дЕлАТь БуДЕм? (1 - Инвентарь, 2 - Атака, 3 - Побег, 4 - Отобразить монстров)\n")
        if player_choice == '1':
            inventory()
        elif player_choice == '2':
            attack()
            return 0
        elif player_choice == '3':
            if any(i.speed >= player.stats['Ловкость']*2 for i in cur_mon):
                print('МоНсТры слИшкОм бЫстРы... пОбЕг Не УдаЛСя! (˃︿˂)')
                return 0
            print(razdva("- БеЖИм-бЕЖиМ!!\n", "- бЫстРЫе НогИ вРаГоВ Не БоЯтСЯ!\n"))
            for i in cur_mon:
                cur_mon.remove(i)
            pause()
            return 0
        elif player_choice == '4':
            mon_meet()
            choice_menu()
    def inventory(a = 1):
        print(razdva("- ВОтаКвОТ\n", "- НУ ДавАЙ поСМОтРиМ\n"))
        player.show_all()
        player_inventory_choice = ''
        if player.free_points == 0:
            while player_inventory_choice not in ['1', '2', '3', '4', '5']:
                player_inventory_choice = input("- ЧтО ТеПЕрЬ? (1 - Поглотить, 2 - Надеть, 3 - Ничего, 4 - Снять, 5 - Рассмотреть)\n")
        else:
            while player_inventory_choice not in ['1', '2', '3', '4', '5', '6']:
                player_inventory_choice = input("- ЧтО ТеПЕрЬ? (1 - Поглотить, 2 - Надеть, 3 - Ничего, 4 - Снять, 5 - Рассмотреть, 6 - Распредилить очки)\n")
        if player_inventory_choice == '1':
            print("- ЧТо КуШАеМ? :P\n")
            print('     ✦ Инвентарь ✦')
            print('0 - Ничего')
            for i, item in enumerate(player.inventory):
                eat_item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki_consume.get(item)[1][-1] else f'{i[0]} +{i[1]}' for i in wiki_consume.get(item)[1]]
                print(i + 1, '-', item, '|', *eat_item_stats)
            eat_item = ''
            while eat_item not in ['0'] + [str(i+1) for i in range(len(player.inventory))]:
                eat_item = input()
            if eat_item != '0':
                player.consume(player.inventory[int(eat_item)-1])
                pause()
            return inventory(a)
        elif player_inventory_choice == "2":
            print("- ВОт наШ ГАрдЕроБ!! ЧТо НаДЕнЕм? :^\n")
            print('     ✦ Инвентарь ✦')
            usable_inventory = [i for i in player.inventory if i in wiki.keys()]
            print('0 - Ничего')
            for i, item in enumerate(usable_inventory):
                item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki.get(item)[0][-1] else f'{i[0]} +{i[1]}' for i in wiki.get(item)[0]]
                print(i + 1, '-', item, '|', *item_stats)
            puton_item = ''
            while puton_item not in ['0'] + [str(i+1) for i in range(len(usable_inventory))]:
                puton_item = input()
            if puton_item != '0':
                player.equip(usable_inventory[int(puton_item)-1])
                pause()
            return inventory(a)
        elif player_inventory_choice == "4":
            print("- ЧтО СниМаЕм? ( ˙▿˙ )")
            usable_inventory = [i for i in player.equipment if player.equipment[i] != '-']
            for i, item in enumerate(usable_inventory):
                print(i + 1, '-', item + ':', player.equipment[item])
            puton_item = ''
            while puton_item not in [str(i + 1) for i in range(len(usable_inventory))]:
                puton_item = input()
            player.unequip(player.equipment[usable_inventory[int(puton_item) - 1]])
            pause()
            return inventory(a)
        elif player_inventory_choice == "5":
            print("- Я ПОбУдУ ТвОЕй СЛаЙМОпЕдиеЙ!! ЧТо тЫ ХоЧЕшь РаСсмОТрЕтЬ? (* v *)\n")
            player.show_inventory(player.inventory)
            print("0 - Ничего")
            examine_item = ''
            while examine_item not in ['0'] + [str(i + 1) for i in range(len(player.inventory))]:
                examine_item = input()
            if examine_item == '0':
                return inventory(a)
            examine_item = player.inventory[int(examine_item)-1]
            print(wiki_consume.get(examine_item)[0])
            eat_item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki_consume.get(examine_item)[1][-1] else f'{i[0]} +{i[1]}' for i in wiki_consume.get(examine_item)[1]]
            if wiki.get(examine_item):
                item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki.get(examine_item)[0][-1] else f'{i[0]} +{i[1]}' for i in wiki.get(examine_item)[0]]
                print(examine_item, '| 🍽',  *eat_item_stats, '| ⛊',  *item_stats, '|', 'Тип:', wiki_consume.get(examine_item)[-1], '\n')
            else:
                print(examine_item, '| 🍽', *eat_item_stats, '|', 'Тип:', wiki_consume.get(examine_item)[-1], '\n')
            pause()
            return inventory(a)
        elif player_inventory_choice == "6":
            player.points()
            return inventory(a)
        else:
            if a == 0:
                return location()
            return choice_menu()
    def attack():
        for i, mon in enumerate(cur_mon):
            print(i + 1, '-', mon.kind)
        player_attack_choice = ''
        while player_attack_choice not in [str(i+1) for i in range(len(cur_mon))]:
            player_attack_choice = input("- КОго БьЁм?\n")
        att_mon = cur_mon[int(player_attack_choice)-1]
        att_mon.get_hurt(player)
        print(f"- ВПерЁд!! СУщЕствУ {att_mon.kind} нАнЕСеНо {att_mon.hurt} еДинИЦ УрОНа >:D\n" if att_mon.defense < player.stats['Урон']
              else f'- зАщИта пРотИвНИка сиЛьНА... НанЕсЕнНый уРон: {att_mon.hurt}\n')
        if att_mon.health == 0:
            print(razdva("- ХЫхЫ!! ВРаГ ПоВЕрЖен!\n", f"- ХеХЕ! МиНУс {att_mon.kind}!\n"))
            player.exp += att_mon.exp
            print(f"- Мы ПОлУЧилИ {att_mon.exp} ОчКоВ ОпЫТА!\n")
            if player.exp >= player.exp_next:
                player.exp -= player.exp_next
                player.get_level()
            else:
                player.get_exp_bar()
            cur_mon.pop(int(player_attack_choice)-1)
            if att_mon.loot != '':
                print(razdva(f"- ХабАРр (=`ω´=) {att_mon.loot}\n", f"- ХИХИ, СмОтрИ, {att_mon.loot} :DD\n"))
                player.inventory.append(att_mon.loot)
                pause()
                return 0
            if not cur_mon:
                print(razdva('- МЫ вСЕХ ПобЕДиЛи!! (^ o ^)\n', '- Вот И вСё!\n'))
                pause()
                return 0
            pause()
        return 0
    def mon_attack():
        for i in cur_mon:
            player.get_hurt(i)
            if player.stats['Очки здоровья'] == 0:
                print('')
                pause()
                player.die()
                return 0
        print('')
    def battle():
        if 'Бабочка' not in [i.kind for i in cur_mon]:
            while player.stats['Очки здоровья'] != 0 and cur_mon:
                choice_menu()
                mon_attack()
        else:
            while player.stats['Очки здоровья'] != 0 and cur_mon:
                mon_attack()
                if player.stats['Очки здоровья'] != 0:
                    choice_menu()
    locations = gen_loc()
    location()
    if player.location == 'Поляна цветов':
        player.rest()
        pause()
        print("- ...бЫлО вОСстАнОаВлЕно 10 HP\n")
        pause()
        return 0
    cur_mon = gen_mon()
    if randint(1, 30) in range(1, 8):
        print(razdva(wiki_location[player.location][3][0], wiki_location[player.location][3][1]), '\n')
        treasure = choice(wiki_location[player.location][1])
        print(f'       + {treasure}\n')
        player.inventory.append(treasure)
        pause()
    mon_meet()
    battle()

player.show_all()
menu(player)
while player.stats['Очки здоровья'] != 0:
    menu(player)
