from random import *

wiki = {
    'Плащ шамана-гоблина': [[["Урон", 4], ['Защита', 3]], 'Броня'],
    'Диадема лесной дриады': [[['Урон', 6], ['Ловкость', 5]], 'Броня'],
    'Маска стеснительного орка': [[['Защита', 7], ['Очки здоровья', 4]], 'Броня'],
    'Накидка из шкуры оленя-перевёртыша': [[['Урон', 5], ['Очки здоровья', 4], ['Защита', -3]], 'Броня'],
    'Пояс разбойника Первого': [[['Урон', 8], ['Очки здоровья', 2], ['Защита', 6]], 'Броня'],
    'Перчатки разбойника Второго': [[['Урон', 10], ['Ловкость', 3], ['Защита', 6]], 'Броня'],

    'Книга заклинаний': [[['Урон', 6]], 'Орудие'],
    'Орб-слизь': [[['Урон', 10], ['Защита', 6]], 'Орудие'],
    'Ножи разбойника': [[['Урон', 8], ['Скорость', 4]], 'Орудие'],
    'Плеть разбойника': [[['Урон', 6], ['Скорость', 7]], 'Орудие'],
    'Дубинка стеснительного орка': [[['Урон', 12], ['Скорость', -4]], 'Орудие'],
    'Рыцарский меч': [[['Урон', 6]], 'Орудие'],
    'Посох шамана-гоблина': [[['Урон', 7]], 'Орудие'],
    'Клинок. Просто клинок.': [[['Урон', 6], ['Скорость', 4]], 'Орудие'],

    'Клык звёздной лисицы': [[['Урон', 6], ['Защита', 8]], 'Аксессуар'],
    'Кулон лесной дриады': [[['Урон', 6], ['Защита', 6]], 'Аксессуар'],
    'Рог оленя-перевёртыша': [[['Урон', 8], ['Скорость', 4]], 'Аксессуар'],
    'Серьга гоблина': [[['Урон', 5], ['Защита', 2]], 'Аксессуар'],
    'Талисман Сияющей слизи': [[['Урон', 6], ['Скорость', 6], ['Защита', 8]], 'Аксессуар'],
}
wiki_monsters = {
    "Бабочка": [(1,2), (1,1), (13,18), (0,0), (0,1), 17],
    "Гоблин": [(3,6), (3,6), (2,5), (2,5), (2,4), 15,
            ['Серьга гоблина', 'Ягодный сок', 'Посох шамана-гоблина']],
    "Гоблин-шаман": [(3,6), (4,7), (2,4), (2,5), (3,5), 20,
            ['Плащ шамана-гоблина', 'Книга заклинаний', 'Ягодный сок']],
    "Орк": [(5,9), (6,8), (2,4), (4,6), (13,16), 25,
            ['Красное яблоко', 'Пятнистый гриб', ]],
    "Стеснительный орк": [(10,16), (7,10), (2,4), (7,12), (22,30), 34,
            ['Маска стеснительного орка', 'Красное яблоко', 'Дубинка стеснительного орка']],
    "Голубая слизь": [(5,8), (3,5), (13,18), (2,5), (8,15), 34,
            ['Голубая слизь', 'Пятнистый гриб', 'Родниковая вода', 'Талисман Сияющей слизи', 'Орб-слизь']],
    "Розовая слизь": [(13,16), (3,5), (2,5), (2,5), (8,15), 30,
            ['Розовая слизь', 'Родниковая вода', 'Книга заклинаний', 'Талисман Сияющей слизи', 'Орб-слизь']],
    "Красная слизь": [(3,6), (8,10), (2,5), (2,5), (8,15), 25,
            ['Красная слизь', 'Красное яблоко', 'Родниковая вода', 'Талисман Сияющей слизи', 'Орб-слизь']],
    "Олень-перевёртыш": [(15,20), (8,14), (7,10), (3,7), (13,20), 35,
            ['Накидка из шкуры оленя-перевёртыша', 'Рог оленя-перевёртыша', ]],
    "Разбойник":[],
    "Разбойник Первый":[],
    "Разбойник Второй":[],
    "Дриада":[],
    "Шипастая Дриада":[],
    "???":[],
}
wiki_consume = {
    "Ягодный сок": ["- СооООоок (˶˃⤙˂˶)",
            [['Очки здоровья', 5], ['Ловкость', 3]], "Еда"],
    "Кровь лесной дриады": ["- ПаХнЕт ЦвЕтамИ",
            [['Очки здоровья', 6], ['Ловкость', 2], ['Защита', 1]], "Еда"],
    "Розовая слизь": ["- мНе НрАвИтся РоЗоВЫЙ :>> а теБе?",
            [['Очки здоровья', 10]], "Еда"],
    "Голубая слизь": ["- ПоЧеМУ-То ВсеГдА хоЛоДнаЯ",
            [['Ловкость', 5]], "Еда"],
    "Красная слизь": ["- на вкУс кАК рУбИны ⊹˙✦°。",
            [['Урон', 6]], "Еда"],
    "Красное яблоко": ["- КрАсииИВое",
            [['Очки здоровья', 4], ['Ловкость', 3]], "Еда"],
    "Паёк разбойника": ["- ЧеЛоВеЧЕскАя еДА",
            [['Очки здоровья', 4], ['Ловкость', 3]], "Еда"],
    "Пятнистый гриб": ["- вЫглЯдиТ ОчЕнЬ СТраНно (←人←)",
            [['Очки здоровья', -4], ['Защита', -2]], "Еда"],
    "Родниковая вода": ["- пРоЗрааЧнАя (ノ= ⩊ = )ノ",
            [['Очки здоровья', 4], ['Ловкость', 3]], "Еда"],

    'Плащ шамана-гоблина': ['- ПлАщ, пРоПИТанНЫй ИСКусСТвоМ чуДОдейСТвА ГоБЛиНОв! ЕСЛи оНО У нИХ еСТь? ХыХЫ',
            [["Урон", 1], ['Очки здоровья', 3]], 'Броня'],
    'Диадема лесной дриады': ["- ЦвеТоОчНаЯ кОроНа жЕсТоКОй хРАниТЕльНиЦы лЕсА",
            [['Очки здоровья', 3], ['Ловкость', 2]], 'Броня'],
    'Маска стеснительного орка': ["- ЧёРнАЯ мАСкА пРеДВоДиТЕлЯ оРКоВ. И ГдЕ оН ТоЛьКО ТАкую вЗяЛ, ХмМ",
            [['Защита', 3], ['Очки здоровья', 4]], 'Броня'],
    'Накидка из шкуры оленя-перевёртыша': ["- ОТ еЁ вида МНе нЕМНогО жУТкО...",
            [['Урон', 4], ['Очки здоровья', 3], ['Защита', -1]], 'Броня'],
    'Пояс разбойника Первого': ["- ИлИ ВТОРогО? ТЫ ПоМНиШЬ?",
            [['Урон', 4], ['Очки здоровья', 1], ['Защита', 2]], 'Броня'],
    'Перчатки разбойника Второго': ["- Ну тОЧНо ВтОрОГО",
            [['Урон', 3], ['Ловкость', 1], ['Защита', 3]], 'Броня'],

    'Книга заклинаний': ['- КАкаЯ кНижкАа :З',
                         [['Урон', 7]], 'Орудие'],
    'Орб-слизь': ['- кАк Мы („• ֊ •„)',
                         [['Урон', 6], ['Защита', 6]], 'Орудие'],
    'Ножи разбойника': ['- КАкаЯ кНижкАа :З',
                         [['Урон', 6], ['Скорость', 4]], 'Орудие'],
    'Плеть разбойника': ['- оНа дЕлаЕт сВиСт-хРясЬ ( = □ = )',
                         [['Урон', 6]], 'Орудие'],
    'Дубинка стеснительного орка': ['- тАкаЯ БолЬшАя, хы. И чЕго Он СТеЕСняЛсЯ?',
                         [['Урон', 6]], 'Орудие'],
    'Рыцарский меч': ['- БлЕсТЯщИй И ОстРыЙ, КаК ПОлАгаЕтсЯ РыЦАрю ｡✦°⋆',
                         [['Урон', 6]], 'Орудие'],
    'Посох шамана-гоблина': ['- дЕрЕВЯшКа и кРисТАлиК, а СозДаёТ МАгиЮ ( ´ ▿ ` )',
                        [['Урон', 6]], 'Орудие'],
    'Клинок. Просто клинок.': ['- нУ кЛиНОк и КлИНоК',
                        [['Урон', 6]], 'Орудие'],

    'Клык звёздной лисицы': ['- ваУ... СиЯет, каК звЁздне нЕбо',
                               [['Урон', 6]], 'Аксессуар'],
    'Кулон лесной дриады': ['- ',
                             [['Урон', 6]], 'Аксессуар'],
    'Рог оленя-перевёртыша': ['- ОсТРыййй. ',
                             [['Урон', 6]], 'Аксессуар'],
    'Серьга гоблина': ['- кАмУшеК бЛестИт, хЕхе',
                             [['Урон', 6]], 'Аксессуар'],
    'Талисман Сияющей слизи': ['- он сВетИтся, сМотрИ... иНтерЕСно, КоГдА мЫ тАк смоЖеМ?',
                             [['Урон', 6]], 'Аксессуар'],
}
def razdva(a,b):
    return a if randint(0,1)==0 else b
class Player:
    def __init__(self):
        self.name = ''
        self.stats = []
        self.level, self.exp, self.free_points = -1, 0, 0
        self.equipment = {
            'Броня':'Диадема лесной дриады',
            'Аксессуар': '-',
            'Орудие': '-',
        }
        self.inventory = ['Книга заклинаний', 'Плащ шамана-гоблина']
    def get_stats(self):
        is_fit = 0
        while is_fit != 25:
            stats = {
                'Очки здоровья': randint(3, 10),
                'Урон': randint(2, 10),
                'Ловкость': randint(1, 10),
                'Защита': randint(1, 5),
            }
            is_fit = sum(stats.values())
        self.stats = stats
        self.get_level()
        print("     ЭТО ТЫ\n"
              "       |\n"
              "       v\n")
        # self.greet()
        # self.re_stats()
        # self.name = input("- КСтаТИ, А МЫ веДЬ С ИМенЕМ еЩЕ не ОПреДЕлиЛиь... КАк НАс ЗоВУт??\n")
        self.name = "CHARA"
        print(f"- КрУТо! {self.name}!")
    def get_exp_bar(self):
        self.exp_bar = (self.exp // (self.exp_next//10))*'▓' + (10 - len((self.exp // (self.exp_next//10))*'▓'))*'░'
    def get_level(self):
        self.level += 1
        self.free_points += self.level * 5
        match self.level:
            case 0: self.exp_next = 10
            case 1: self.exp_next = 50
            case 2: self.exp_next = 100
            case 3: self.exp_next = 500
            case 4: self.exp_next = 1000
        self.get_exp_bar()
    def show_all(self):
        print('\n'
            f"⠀⠀⠀⠀⠀⠀⠙⣷⠀⠀⠀⠀⠀⠀      \n"
            f"⠀⠀⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀     Уровень: {self.level}\n"
            f"⠀⢰⡟⠀⠀⠀⠀⠀⠀⠀⢻⣆⠀⠀      \n"
            f"⠸⣤⠀⠀⣿⠀⠀⠀⣿⠀⠀⣤⠇⠀     {self.exp_bar} {self.exp}/{self.exp_next}\n"
            f"⠀ ⠈⠷⢦⠀⠀⠀⡶⠾⠁⠀⠀     \n"
            f"⠀⠀⠀⣰⠛⠋⠉⠙⠛⣆⠀⠀⠀⠀    ・Очки здоровья: {self.stats['Очки здоровья']}\n"
            f"⠀⢠⡟⢰ ⠀⠀⠀ ⡆⢻⡄⠀⠀    ・Урон: {self.stats['Урон']}\n"
            f"⠀⠀⠀⢸⠀⢰⠉⡆⠀⡇⠀⠀⠀⠀    ・Ловкость: {self.stats['Ловкость']}\n"
            f"⠀⠀⠀⠘⠶⠟⠀⠻⠶⠃⠀⠀⠀⠀    ・Защита: {self.stats['Защита']}\n"
        )
        print(f'▐ Броня: {self.equipment["Броня"]}  '
              f'▐ Орудие: {self.equipment["Орудие"]}  '
              f'▐ Аксессуар: {self.equipment["Аксессуар"]}\n')
        print('     ✦ Инвентарь ✦')
        for i, item in enumerate(self.inventory):
            print(i + 1, '-', item)
        print('')
    def greet(self):
        print(
            f"⠀⠀⠀⠀⠀⠀⠙⣷⠀⠀⠀⠀⠀⠀  ・Очки здоровья: {self.stats['Очки здоровья']}\n\n"
            f"⠀⠀⠀⣤⠿⠿⠿⠿⠿⣤⠀⠀⠀⠀ ・Урон: {self.stats['Урон']}\n"
            f"⠀⢰⡟⠀⠀⠀⠀⠀⠀⠀⢻⣆⠀⠀  ・Ловкость: {self.stats['Ловкость']}\n"
            f"⠸⣤⠀⠀⣿⠀⠀⠀⣿⠀⠀⣤⠇⠀  ・Защита: {self.stats['Защита']}\n"
            f"⠀ ⠈⠷⢦⠀⠀⠀⡶⠾⠁⠀⠀  \n"
            f"⠀⠀⠀⣰⠛⠋⠉⠙⠛⣆⠀⠀⠀⠀ \n"
            f"⠀⢠⡟⢰ ⠀⠀⠀ ⡆⢻⡄⠀⠀ \n"
            f"⠀⠀⠀⢸⠀⢰⠉⡆⠀⡇⠀⠀⠀⠀ \n"
            f"⠀⠀⠀⠘⠶⠟⠀⠻⠶⠃⠀⠀⠀⠀ \n"
        )
    def re_stats(self):
        is_ok = ''
        while is_ok not in ['0','1','2']:
            is_ok = input("- кАК ТеБе ХАраКТЕрИсТИКи? ХоЧЕшь ПОмЕняТЬ? (0 - Сойдёт, 1 - Давай поменяем, 2 - Поменяй ты)\n")
        if is_ok == '1':
            print("- ЛАдНО! НАзНАЧаЙ в ТАкОМ ПОряДКе: ЗдОроВЬЕ, УрОН, ЛОвкоСТь, ЗАЩиТа. СМоТри ТоЛЬКО, В СУмМЕ ДоЛЖно БыТь 25!")
            stats_keys = [i for i in self.stats.keys()]
            soul_points = 25
            while soul_points != 0:
                try:
                    planned_stats = input('- ВВодИ 4 ЗнаЧЕнИя. ЧеРЕз ПроБЕЛ!\n')
                    planned_stats = [int(i) for i in planned_stats.split()]
                    for i, key in enumerate(stats_keys):
                        self.stats[key] = planned_stats[i]
                        soul_points -= planned_stats[i]
                    if soul_points != 0:
                        print(f"- ЕЩё ОСТАлОСь {soul_points}! ДАвАЙ ПО НОвОЙ.")
                        if soul_points < 0:
                            print(f'- Да, В МиНУС ПОшлО!')
                        soul_points = 25
                    else:
                        self.greet()
                        self.re_stats()
                except:
                    print("- ЧТО-тО тЫ НАмуДрИл... ПоВТоРи?")
                    self.re_stats()

        elif is_ok == '2':
            print("\n- ЛАДНа! СмОТри!\n")
            self.get_stats()
        elif is_ok == '0':
            print('- МНЕ тОЖЕ ЭтИ НрАВятСЯ :D')
    def get_hurt(self, enemy):
        damage = max(0,(enemy.damage-self.stats['Защита']))
        self.stats['Очки здоровья'] = max(self.stats['Очки здоровья'] - damage, 0)
        print(f'Существо {enemy.kind} атакует!')
        print(f"Вам нанесли {damage} урона. У вас осталось {self.stats['Очки здоровья']} ОЗ.")
    def show_inventory(self, inventory):
        print('     ✦ Инвентарь ✦')
        for i, item in enumerate(inventory):
            print(i+1,'-', item)
    def unequip(self, item):
        self.equipment[wiki[item][-1]] = '-'
        self.inventory.append(item)
        item_stats = wiki[item][0]
        # print(f"- оЙ! ХАрАКТЕриСТиКа {i[0]} уПАлА на {i[1]} D:" if i[0] < 0 else f"- МиНУс дЕбАфф нА {i[0]} (•▽•) +{i[1]}")
        print(f"- Мы СнЯЛиИ: {item} (0 ,<)", *[i[0] + ' -' + str(i[1]) for i in item_stats], "\n")
        for i in item_stats:
            self.stats[i[0]] -= i[1]
        print('')
    def equip(self, item):
        if self.equipment[wiki[item][-1]] == '-':
            self.equipment[wiki[item][-1]] = item
            self.inventory.remove(item)
            print(f"- ОБнОВка!! {item}")
        elif self.equipment[wiki[item][-1]] != '-':
            yesno = ''
            while yesno not in ['1','2']:
                print(f"- ЭтА каТЕгОРИя уЖЕ зАНЯтА: {self.equipment[wiki[item][-1]]}. ПОмЕнЯеМ? (1 - Да, 2 - Нет)")
                yesno = input()
            if yesno == '1':
                self.unequip(self.equipment[wiki[item][-1]])
                return self.equip(item)
            else:
                return print("")
        print(f"- ХарАКтеРИстИКА {i[0]} ВоЗРОсЛа нА {i[1]}! :D" if i[0] < 0 else f"- оЙ, миНуС нА {i[0]} (•□•) -{i[1]}")
        for i in wiki[item][0]:
            # print(f"- ХарАКтеРИстИКА {i[0]} ВоЗРОсЛа нА {i[1]}! :D" if i[0]<0 else f"- оЙ, миНуС нА {i[0]} (•□•) -{i[1]}")
            self.stats[i[0]] += i[1]
        print('')
    def consume(self, item):
        # yesno = ''
        # while yesno not in ['1', '2']:
        #     yesno = input(f'- ТоЧнО МОжНо {item}? (1 - Да, 2 - Нет)\n')
        # if yesno == "1":
            item_stats = wiki_consume[item][1]
            print(f"- НакУшАлИ, хЕх ૮₍ •⤙•˶₊ ", *[i[0] + ' +' + str(i[1]) for i in item_stats], '\n')
            for i in item_stats:
                # print(f"- НакУшАлИ, хЕх ૮₍ •⤙•˶₊ {i[0]} +{i[1]}")
                self.stats[i[0]] += i[1]
            self.inventory.remove(item)
player = Player()
print("- ПРиВЕи! ДоБРо ПОжаЛоВать в МИр! КтО я? НУ... КтО-тО? БЕз ПОНЯтиЯ, КтО Я. ЗаТО ЗнАЮ, ЧТО ты - ЧеЛОвЕкоПоДОбнАя сЛИзЬ!\n")
player.get_stats()
class Creature:
    def __init__(self, kind, health=(3,10), damage = (1,10), speed=(1,10), defense=(1,5), experience=(3,6), stats_base=25, loot = ['']):
        self.level = randint(player.level-1,player.level+1)
        self.level = 0
        self.exp = randint(*experience)
        self.kind = kind
        self.loot = choice(loot) if randint(0,1) == 0 else ''
        is_fit = 0
        while is_fit != (stats_base + self.level * 5):
            self.health = randint(*health)
            self.damage = randint(*damage)
            self.speed = randint(*speed)
            self.defense = randint(*defense)
            is_fit = self.health+self.damage+self.speed+self.defense
    def show_stats(self):
        print(
            f'Существо {self.kind}\n'
            f'{"-"*20}\n'
            f'Очки здоровья: {self.health}\n'
            f'Урон: {self.damage}\n'
            f'Ловкость: {self.speed}\n'
            f'Защита: {self.defense}\n'
        )
    def attack(self):
        player.get_hurt(self)
    def get_hurt(self, enemy):
        self.hurt = max(1,(enemy.stats['Урон']-self.defense))
        self.health = max(self.health - self.hurt, 0)

def menu(player):
    def pause():
        a = input('(Enter для продолжения)\n')
    def mon_meet(amount = randint(1,3)):
        for i in cur_mon_code:
            i.show_stats()
        choice_menu()
    def choice_menu():
        player_choice = ''
        while player_choice not in ['1','2','3','4','5']:
            player_choice = input("- ЧтО дЕлАТь БуДЕм? (1 - Инвентарь, 2 - Атака, 3 - Уклонение, 4 - Побег, 5 - Отобразить монстров)\n")
        if player_choice == '1':
            inventory()
        elif player_choice == '2':
            attack()
        elif player_choice == '3':
            f = 0
        elif player_choice == '4':
            print(razdva("- БеЖИМ-БЕЖиМ!!\n", "- БЫстРЫе НогИ ВРаГоВ Не БоЯтСЯ!\n"))
            pause()
            return 0
        elif player_choice == '5':
            mon_meet()
    def inventory():
        print(razdva("- ВОтаКвОТ\n", "- НУ ДавАЙ поСМОтРиМ\n"))
        player.show_all()
        player_inventory_choice = ''
        while player_inventory_choice not in ['1', '2', '3', '4']:
            player_inventory_choice = input("- ЧтО ТеПЕрЬ? (1 - Поглотить, 2 - Надеть, 3 - Ничего, 4 - Снять, 5 - Рассмотреть)\n")
        if player_inventory_choice == '1':
            print("- ЧТо КуШАеМ? :P\n")
            player.show_inventory(player.inventory)
            # eat_item = input()
            # if eat_item in [str(i + 1) for i in range(len(player.inventory))]:
            #     player.consume(player.inventory[int(eat_item) - 1])
            #     pause()
            eat_item = ''
            while eat_item not in [str(i+1) for i in range(len(player.inventory))]:
                eat_item = input()
            player.consume(player.inventory[int(eat_item)-1])
            pause()
            return inventory()
        elif player_inventory_choice == "2":
            print("- ВОт наШ ГАрдЕроБ!! ЧТо НаДЕнЕм? :^\n")
            usable_inventory = [i for i in player.inventory if i in wiki.keys()]
            player.show_inventory(usable_inventory)
            puton_item = ''
            while puton_item not in [str(i+1) for i in range(len(usable_inventory))]:
                puton_item = input()
            player.equip(usable_inventory[int(puton_item)-1])
            pause()
            return inventory()
        elif player_inventory_choice == "4":
            print("- ЧтО СниМаЕм? ( ˙▿˙ )")
            usable_inventory = [i for i in player.equipment if player.equipment[i] != '-']
            for i, item in enumerate(usable_inventory):
                print(i + 1, '-', item + ':', player.equipment[item])
            puton_item = ''
            while puton_item not in [str(i + 1) for i in range(len(usable_inventory))]:
                puton_item = input()
            player.unequip(player.equipment[usable_inventory[int(puton_item) - 1]])
            pause()
        elif player_inventory_choice == "5":
            print("- Я ПОбУдУ ТвОЕй СЛаЙМОпЕдиеЙ!! ЧТо тЫ ХоЧЕшь РаСсмОТрЕтЬ? (* v *)\n")
            # for item in player.inventory:
            #     item_stats = [f'| {i[0]} +{i[1]}' for i in wiki.get(item)[1]]
            #     print(item, *item_stats, wiki.get(item)[0])
            player.show_inventory(player.inventory)
            examine_item = ''
            while examine_item not in [str(i + 1) for i in range(len(player.inventory))]:
                examine_item = input()
            examine_item = player.inventory[int(examine_item)-1]
            item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki.get(examine_item)[1][-1] else f'{i[0]} +{i[1]}' for i in wiki.get(examine_item)[1]]
            eat_item_stats = [f'{i[0]} +{i[1]} ⁝' if i != wiki.get(examine_item)[1][-1] else f'{i[0]} +{i[1]}' for i in wiki.get(examine_item)[1]]
            print(wiki.get(examine_item)[0])
            print(examine_item, '| 🍽',  *item_stats, '| ⛊',  *item_stats, '|', 'Тип:', wiki.get(examine_item)[-1])
            pause()
            return inventory()
        else:
            return choice_menu()
    def attack():
        for i, mon in enumerate(cur_mon_code):
            print(i + 1, '-', mon.kind)
        player_attack_choice = ''
        # print('')
        while player_attack_choice not in [str(i+1) for i in range(len(cur_mon))]:
            player_attack_choice = input("- КОго БьЁм?\n")
        att_mon = cur_mon_code[int(player_attack_choice)-1]
        att_mon.get_hurt(player)
        print(f"- ВПерЁд!! СУщЕствУ {att_mon.kind} нАнЕСеНо {att_mon.hurt} еДинИЦ УрОНа >:D\n" if att_mon.hurt != 1
              else f'- БЛиИИнб, МОнСТр {att_mon.kind} ПоЧтИ нЕ ПОлуЧиЛ УРонА. ВсЕгО еДИниЧКа :((\n')
        if att_mon.health == 0:
            print(razdva("- ХЫхЫ!! ВРаГ ПоВЕрЖен!\n", f"- ХеХЕ! МиНУс {att_mon.kind}!\n"))
            player.exp += att_mon.exp
            print(f"- Мы ПОлУЧилИ {att_mon.exp} ОчКоВ ОпЫТА!\n")
            if player.exp >= player.exp_next:
                player.exp -= player.exp_next
                player.get_level()
            else:
                player.get_exp_bar()
            cur_mon_code.pop(int(player_attack_choice)-1)
            if att_mon.loot != '':
                print(razdva(f"- ХАбР-ХАбАбр-ХаБАР1! {att_mon.loot}\n", f"- ХИХИ, СчАЧстьЯ прИвАлИло, СмОтрИ, {att_mon.loot} :DD\n"))
                player.inventory.append(att_mon.loot)
            if not cur_mon_code:
                print(razdva('- МЫ вСЕХ ПобЕДиЛи!! (^ o ^)\n', '- ПОоОбЕДА!!'))
                pause()
                return 0
        choice_menu()
    if randint(1,30) in range(1,29):
        print(razdva('- Ой, НаПАдаЮТ!\n', '- МонСтРЫ, моНсТры!\n'))
        cur_mon = [choice(list(wiki_monsters.keys())[:-1]) for i in range(randint(1,3))]
        cur_mon_code = [Creature(i, *wiki_monsters[i]) for i in cur_mon]
        mon_meet()
    else:
        print(razdva('- СУнДУК!!!\n', '- СОкРовИща, УРа!\n'))
        treasure = choice(list(wiki.keys()))
        print(f'- {treasure}! Всё В ДОм, ВСё в ДОмМ ХыхЫ\n')
        player.inventory.append(treasure)

player.show_all()
# menu(player)
while player.stats['Очки здоровья'] != 0:
    menu(player)
